{"authorDailyContributionsMap":{"Teng-Yong-Quan":[{"date":"2025-01-26","commitResults":[{"hash":"58eeb4dc717435f624cb857bb3b797656dfcce51","isMergeCommit":false,"messageTitle":"Rename Duke.java to Yq.java","messageBody":"Rename chatbot Duke to Yq\n\nCreate statements that allow chatbot Yq to greet and exits\n","tags":["Level-0"],"fileTypesAndContributionMap":{"java":{"insertions":16,"deletions":10}}},{"hash":"19a1b3818d2528b17d52f8a3880e7acc457eddbe","isMergeCommit":false,"messageTitle":"Make chatbot Yq echo the command that the user inputs","messageBody":"The chatbot Yq will echo whatever command or line that the user inputs\nwithin a \u0027while\u0027 loop until the user inputs \"bye\" then the chatbot Yq\nwill stop running.\n\nAdd processForThreeSeconds() method\n\nThis acts as a processing time for chatbot Yq whenever it receives a\ncommand from the user\u0027s input.\n","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":30,"deletions":2}}},{"hash":"0538a4fa6ca50403d8b0f1ae65102169ee4742a9","isMergeCommit":false,"messageTitle":"Add the ability to store and display text","messageBody":"The chatbot Yq is able to store the text entered by the user in a list\nand display the contents in the list as requested.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":33,"deletions":3}}}]},{"date":"2025-01-27","commitResults":[{"hash":"07364290775b19a2a06b5dc13d0b0a57057325d7","isMergeCommit":false,"messageTitle":"Add Task.java which contains Task class","messageBody":"This is more user-friendly as it allows user to work at the level of\nobjects while ignoring the data attributes and method implementation\ndetails. User can store multiple attributes within a Task object and\nthe attributes are only accessible using the Task object\u0027s interface.\n\nLet\u0027s create class Task and construct attributes getters and setters\nand other relevant methods for the class Task.\n\nThis replaces the usage of the String to represent the task and the\nTask list (array) is used instead of a String array and allows user to\ninteract the objects via different methods.\n\nReplace method processForThreeSeconds() to processForOneSecond()\n\nIt is taking slightly long before the user can enter the next command.\nSome user may be impatient and accidentally keys in command while the\nchatbot Yq is processing an action. This could trigger error and bring\ninconvenience to the user.\n\nReduce 3-seconds delay to a 1-second delay.\n\nThis reduces the waiting time of the user while giving more realism as\nprogram requires time to process an action or command input by the user.\n\nCreate methods printList(), addTask(), markTask() and unmarkTask()\n\nBy compiling the codes into different methods, it is more readable,\ncleaner and user-friendly as requested to display task list contents,\nadd task into the task list, mark task as done and mark task as not\ndone. Try and catch exceptions are added in markTask() and unmarkTask()\nto prevent invalid input number by the user as it involves the user\u0027s\ninput to extract the Task with their corresponding position from the\nTask list.\n\nMake each action or command by the user as a method.\n\nMore methods may be implemented in the future and certain methods would\nrequire some sort of output such as an Array (Task List). It is also\nmore convenient to add on more methods if more commands are needed for\nthe chatbot Yq.\n","fileTypesAndContributionMap":{"java":{"insertions":214,"deletions":43}}},{"hash":"77cd56b56c7f454a9fa50283eb8aa94ad8f0c85f","isMergeCommit":false,"messageTitle":"Add more customisations such as command options display and step-by-step user input prompt in Yq.java","messageBody":"This makes the chatbot Yq user-friendly as the user becomes aware of the\ncommand it accepts. For \u0027mark\u0027, \u0027unmark\u0027 and \u0027add\u0027 commands, the user\ncan input the number or task when prompted after entering the respective\ncommand.\n","tags":["Level-3"],"fileTypesAndContributionMap":{"java":{"insertions":53,"deletions":11}}},{"hash":"2521838937305bcd204f6057b8e8e10a5fcbca08","isMergeCommit":false,"messageTitle":"Make minor adjustments to the code to comply with Java Coding Standard","messageBody":"Remove empty lines in the codes and ensure the codes follow the\nconventions.\n","fileTypesAndContributionMap":{"java":{"insertions":25,"deletions":30}}}]},{"date":"2025-01-29","commitResults":[{"hash":"82a2c507fdc0cd705bfc786b03cab74522aa0cb7","isMergeCommit":false,"messageTitle":"Refine markTask() and unmarkTask() methods in Yq.java","messageBody":"The condition, whereby the task list is empty, located outside the\nmarkTask() and unmarkTask() methods is unnecessary as it is already\naccounted for in both methods. Also, it is inconvenient for the user to\nkeep entering the \u0027mark\u0027 and \u0027unmark\u0027 command whenever the user keys in\nan invalid number to extract the task to be marked as done or not done.\n\nRemove the exterior if-condition when the task list is empty and\nimplement a while loop which encapsulates the try-catch statements\nwithin the markTask() and unmarkTask() methods.\n\nA while loop encapsulating the try-catch statements in both methods\nallows the user to input a valid number after keying in the wrong number\nwithout the need to exit the markTask() or unmarkTask() method and key\nin the command again.\n\nChange methods from setIsDone() to setDone() and getIsDone() to isDone()\nin Task.java\n\nThis is to improve readability and ensures that the method name follows\nthe coding standard.\n","tags":["A-CodingStandard"],"fileTypesAndContributionMap":{"java":{"insertions":99,"deletions":95}}}]}]},"authorFileTypeContributionMap":{"Teng-Yong-Quan":{"java":286,"md":0,"fxml":0,"sh":0,"bat":0,"gradle":0,"txt":0}},"authorContributionVariance":{"Teng-Yong-Quan":8290.159},"authorDisplayNameMap":{"Teng-Yong-Quan":"TENG..QUAN"}}
